import SiteAd from 'widgets/Common/Responsive/SiteAd';

const ContactUsMobile = ({ pageAds }) => {
    return (
        <>
            <div className="brdcrm">
                <a href="/">Hindi News</a> <span> › </span><strong>संपर्क करें</strong>
            </div>
            <div className='clearfix add'>
                <div className='addinner-box addinner_box_300x250'>
                    <span id="first">विज्ञापन</span>
                    <SiteAd
                        width={336}
                        height={280}
                        slotId={'mobileAdNew300x250_0'}
                        adUnit={pageAds?.ATF_320}
                        sizes={[
                            [300, 250],
                            [336, 280]
                        ]}
                    ></SiteAd>
                </div>
            </div>
            <div className="outer">
                <div className="section-blog">
                    <div className=" section-blog-left  resLiftSideFull">
                        <div className="pd15 section-blog-left-aricle">
                            <h1 className="f_heading">संपर्क करें</h1>
                            <div id="text_contener">
                                <p>News18 Hindi में हम आपके विचारों का हमेशा स्वागत करते हैं. अगर आपके कोई प्रश्न, टिप्पणी या सुझाव हैं, तो कृपया हमें
                                    &nbsp;<a href="mailto:editor@news18india.com">editor@news18india.com</a> पर भेजें या फिर अपने सुझाव हमें 51818 पर SMS करें.</p>

                                <p>आप हमें नीचे दिए पते पर पत्र भी भेज सकते हैं:</p>

                                <p><b>ग्लोबल ब्रॉडकास्ट न्यूज़, एक्सप्रेस ट्रेड टॉवर</b></p>

                                <p>प्लॉट नं. 15-16, सेक्टर-16A, नोएडा, उत्तर प्रदेश </p>
                                <p>भारत - 201301</p>
                                <p>फैक्स - 0120-4324106</p>

                                <br />

                                <p><b>सावधान! भर्तियों के नाम पर हो रही जालसाजी </b></p>
                                <p>कॉरपोरेट फ्रॉड अब बेकाबू हो चुके हैं. बीते वर्षों के दौरान ऐसे मामलों में बेतहाशा बढ़ोतरी हुई है. हमने यानी नेटवर्क18 मीडिया एंड इन्वेस्टमेंट्स लिमिटेड और इसकी ग्रुप कंपनियों को पता चला है कि कुछ जालसाज और कंपनियां सीधे-सादे बेरोजगारों को बरगला रही हैं. उन्हें शानदार नौकरियों का ऑफर देने का वादा किया जा रहा है. ऐसे किसी बेरोजगार के झांसे में आ जाने पर ये जालसाज उसे नौकरी के बदले किसी खास बैंक में पैसे ट्रांसफर करने के लिए कहते हैं. ये जालसाज ऐसा माहौल तैयार करते हैं, जिससे ऐसा महसूस होता है कि कोई वास्तविक इंटव्यू या अपॉइंटमेंट चल रहा है. </p>

                                <p><b>ऐसे होती है ये जालसाजी:  </b><br />

                                    -पहली बार इतने कम पैसों की मांग की जाती है कि बेरोजगार व्यक्ति अलर्ट नहीं हो पाता है या फिर इस बात पर ज्यादा ध्यान नहीं देता.</p>

                                <p></p>

                                <p>-जैसे ही वह बेरोजगार व्यक्ति चंगुल में फंसता है, तो फिर ये जालसाज इंटरव्यू/अपॉइंटमेंट की तारीख नजदीक आने तक धीरे-धीरे और ज्यादा रकम की मांग करना शुरू कर देते हैं.</p>

                                <p>ऐसा भी देखने में आया है कि शुरुआती स्टार्ट-अप किट के नाम पर बड़ी रकम या सामान की डिमांड भी की जाती है. उदाहरण के लिए लैपटॉप, कंप्यूटर या ट्रेनिंग देने के बहाने. </p>

                                <p>-हमें मिली जानकारी के मुताबिक ये जालसाज पैसों के अलावा लोगों की व्यक्तिगत जानकारियां भी एप्लिकेशन प्रोसेस करने के नाम पर मांगते हैं. बाद में इस डेटा को बेच दिया जाता है.</p>

                                <p><b>हम धोखाधड़ी अलर्ट के जरिये नौकरी की तलाश कर रहे सभी आवेदकों को सावधान करना चाहेंगे कि नेटवर्क18 मीडिया एंड इंवेस्टमेंट लिमिटेड और इस समूह की कंपनियां: </b></p>

                                <p>*आवेदकों से नौकरी/इंटरव्यू या फिर लैपटॉप/यूनिफॉर्म इत्यादि उपलब्ध कराने के एवज में किसी भी प्रकार का पैसा या डिपॉजिट नहीं मांगती हैं. </p>
                                <p>*नेटवर्क 18 समूह की कंपनियां नौकरी देने के लिए अपनी तरफ से किसी भी एजेंट, एजेंसी या व्यक्ति को नियुक्त नहीं करती हैं. </p>
                                <p>*नौकरी के लिए किसी भी तरह के व्यक्तिगत दस्तावेज जैसे मार्कशीट, पैनकार्ड, आधार कार्ड, रिज्यूम या अन्य दस्तावेज WhatsApp पर नहीं मांगती हैं.</p>
                                <p>*कम्युनिकेशन के लिए व्यक्तिगत ईमेल आईडी जैसे जीमेल, याहू, हॉटमेल, आउटलुक इत्यादि का इस्तेमाल नहीं करती हैं. नौकरी के संदर्भ में सभी आधिकारिक कम्युनिकेशन उस ईमेल-आईडी से की जाती है, जिसके अंत में '@nw18.com' लिखा होता है. </p>
                                <p>*नौकरी तलाश रहा कोई भी व्यक्ति यदि ऐसी किसी एजेंसी, रोजगार पोर्टल या व्यक्ति के साथ संपर्क में है, तो ये उसका व्यक्तिगत मामला है. नेटवर्क18 और उसकी ग्रुप कंपनियां इस प्रक्रिया में किसी भी तरह के नुकसान के लिए प्रत्यक्ष या अप्रत्यक्ष तौर पर जिम्मेदार नहीं हैं. </p>
                                <p>ये आपके और हमारे पारस्परिक हित में होगा कि अगर आपको नौकरी से जुड़ी किसी भी तरह की संदिग्ध गतिविधि का आभास होता है, तो हमारी फ्रॉड एंड मिसकंडक्ट इन्वेस्टीगेशन टीम (Fraud &amp; Misconduct Investigations team) को <a href="mailto:recruitment.fraud@nw18.com"> recruitment.fraud@nw18.com</a> पर तुरंत जानकारी दें.</p>

                                <p><b>
                                  शिकायत अधिकारी-<br />

                                  सत्यजीत साहू <br />
                                  सीनियर काउंसल लीगल <br />

                                  संपर्क: complaint@nw18.com
                                </b></p>

                                <p>
                                    रजिस्टर्ड ऑफिस: कॉरपोरेट कम्युनिकेशन टेलीफोन : (+91 22) 40019000<br />

                                    प्रथम तल, एम्पायर कॉम्प्लेक्स, 414 सेनापति बापट मार्ग, <br />

                                    लोवर परेल, मुंबई - 400013<br />

                                    महाराष्ट्र, भारत<br />

                                    CIN: L65910MH1996PLC280969
                                </p>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
            <style jsx global>{`
                * {
                    margin: 0;
                    padding: 0;
                    outline: 0;
                }
                body {
                    font-family: Mukta, sans-serif!important;
                }
                .brdcrm {
                    padding: 10px 16px;
                    font-size: 15px;
                }
                .add {
                    background: #dbdde3!Important;
                }
                .add, .add2 {
                    z-index: 1;
                    background: #dbdde3;
                    position: relative;
                    padding: 16px 0;
                    line-height: 0;
                    text-align: center;
                }
                div.addinner_box_300x250 {
                    height: 268px;
                    width: 373px;
                }
                .clearfix {
                    clear: both;
                }
                .clearfix:after, .clearfix:before {
                    content: "";
                    display: block;
                    clear: both;
                    visibility: hidden;
                    line-height: 0;
                    height: 0;
                }
                .addinner-box span {
                    color: #797e90;
                    font-size: 11px;
                    text-align: center;
                    padding: 2px 0 0;
                    display: block;
                    line-height: 16px;
                    background-color: #e8e9ed;
                    width: 300px;
                    margin-left: 37px;
                }
                .outer {
                    padding: 15px;
                }
                .section-blog h1 {
                    font-size: 26px;
                    line-height: 28px;
                    margin: 8px 0;
                    font-weight: 700;
                }
                .section-blog p {
                    color: #404040;
                    padding-bottom: 20px;
                    font-size: 16px;
                    line-height: 28px;
                }
                .section-blog p a {
                    color: #e33a0f;
                }
            `}</style>
        </>
    );
};

export default ContactUsMobile;
