const MatchScheduleTabs = {
  SCHEDULE_BY_SERIES: "series",
  SCHEDULE_BY_MONTH: "month",
  SCHEDULE_BY_DATE: "date",
};

const CricketNextImgUrls = {
  teamFlagUrl: "https://xmlns.cricketnext.com/cktnxt/scorecard/crk_player_images/flags/160x90/",
  teamFlagFallbackUrl: "https://xmlns.cricketnext.com/cktnxt/scorecard/crk_player_images/DefaultFlag-320x180.png",
  vsImgUrl: "https://images.news18.com/static_news18/pix/ibnhome/news18/images/cricket/Schedule-vs.png",
  vsRedImgUrl: "https://images.news18.com/static_news18/pix/ibnhome/news18/images/cricket/result-vs.png",
  playerThumbnailUrl: "https://xmlns.cricketnext.com/cktnxt/scorecard/crk_player_images/players/128X128"
};

const PlayerProfileTabs = {
  PLAYER_INFO: "playerInfo",
  BATTING: "batting",
  BOWLING: "bowling",
  NEWS: "news",
};

const PlayerProfileTableHeaders = {
  playerPersonalInfo: ["व्यक्तिगत जानकारी", ""],
  playerInfo: ["आईसीसी रैंकिंग", "वनडे", "टेस्ट", "टी20"],
  battingStats: ["बैटिंग", "टेस्ट", "वनडे", "टी20"],
  bowlingStats: ["बॉलिंग", "टेस्ट", "वनडे", "टी20"],
};

const TeamsBioContent = {
  "AUSTRALIA": '<p class="pageContent">ऑस्ट्रेलिया की टीम टेस्ट इतिहास का पहला मैच जीतने वाली टीम है. ऑस्ट्रेलिया (Australia) ने मार्च 1877 में मेलबर्न में खेले गए मुकाबले में इंग्लैंड को 45 रन से हराया था. यह टेस्ट इतिहास का पहला टेस्ट था. डेव ग्रेगरी की कप्तानी में टीम ने यह इतिहास बनाया था. इस तरह से ग्रेगरी टेस्ट इतिहास का पहला मैच जीतने वाले कप्तान भी बने. ऑस्ट्रेलिया ने 1882 में विदेश में खेले दूसरे टेस्ट में भी जीत हासिल कर ली थी.</p><p class="pageContent">ऑस्ट्रेलिया वनडे और टेस्ट फॉर्मेट में सबसे कामयाब टीम है. उसने आईसीसी वनडे विश्व कप 5 बार जीता है. ऑस्ट्रेलिया टेस्ट इतिहास में भी सबसे अधिक टेस्ट मैच जीतने वाली टीम भी है. उसने अब तक 394 टेस्ट जीते हैं.</p><p class="pageContent">ऑस्ट्रेलिया ने भारत में भी खेले पहले टेस्ट में जीत दर्ज की थी. 19 अक्टूबर 1956 को चेन्नई में खेले गए मैच में ऑस्ट्रेलिया को पारी और 5 रन से जीत मिली थी. ऑस्ट्रेलिया की टीम जल्द ही 400 टेस्ट जीतने का रिकॉर्ड बना सकती है. टीम की ओर से टेस्ट में अब तक 46 खिलाड़ी कप्तानी कर चुके हैं. 8 एक भी टेस्ट नहीं जीत सके. रिकी पोंटिंग ने बतौर कप्तान सबसे अधिक 48 टेस्ट जीते हैं. ऑस्ट्रेलिया ने ही लगातार 16 टेस्ट जीतने का वर्ल्ड रिकॉर्ड बनाया है. टीम 2 बार ऐसा कर चुकी है.</p>',
  "BANGLADESH": '<p class="pageContent">बांग्लादेश (Bangladesh) दुनिया के नक्शे में 1971 में अस्तित्व में आया. इस कारण एक टीम के तौर पर यहां क्रिकेट की शुरुआत भी देर से हुई. आईसीसी की ओर से पूर्ण सदस्य की मान्यता के लिए इसे इंतजार करना पड़ा. बांग्लादेश बतौर क्रिकेट टीम तब सबसे अधिक चर्चा में आया, जब उसने 1999 के विश्व कप में पाकिस्तान को हराया. वसीम अकरम की कप्तानी वाली टीम उन दिनों दुनिया की सबसे मजबूत टीमों में शामिल थी और 1999 के विश्व कप का फाइनल भी खेली थी.</p><p class="pageContent">बांग्लादेश ने पहला टेस्ट 10 नवंबर 2000 को भारत के ही खिलाफ खेला था. हालांकि टीम को इसमें हार मिली थी. टीम को पहली जीत के लिए 5 साल तक इंतजार करना पड़ा. 6 जनवरी 2005 को चटगांव में खेले गए टेस्ट में टीम ने जिम्बाब्वे को 226 रन से हराकर पहली जीत दर्ज की थी.</p><p class="pageContent">टेस्ट क्रिकेट में लगातार 21 टेस्ट हारने का खराब रिकॉर्ड बांग्लादेश के ही नाम है. बांग्लादेश को 2001 से लेकर 2004 तक लगातार 21 मैच में हार मिली. हालांकि अब यह टीम श्रीलंका, इंग्लैंड और ऑस्ट्रेलिया जैसी दिग्गज टीमों के खिलाफ टेस्ट जीत चुकी है. लेकिन अभी भी टीम का प्रदर्शन टेस्ट में औसत से नीचे ही है. कई बड़ी टीमों के खिलाफ उसे अभी भी पहली जीत का इंतजार है. बांग्लादेश की ओर से अब तक 11 खिलाड़ी कप्तानी कर चुके हैं. 5 को एक भी टेस्ट में जीत नहीं मिली है. मुशफिकुर रहीम की कप्तानी में टीम ने सबसे अधिक 7 टेस्ट जीते हैं.</p>',
  "ENGLAND": '<p class="pageContent">इंग्लैंड (England) क्रिकेट का जन्मदाता देश है. वह दुनिया में सबसे अधिक टेस्ट मैच खेलने वाली टीम है. इंग्लैंड की टीम अब तक 1000 से अधिक टेस्ट खेल चुकी है. अन्य कोई टीम ऐसा नहीं कर सकी है. वनडे और टी20 फॉर्मेट में इंग्लैंड की गिनती दुनिया की बेहतरीन टीमों में होती है. वनडे फॉर्मेट में विश्व खिताब फिलहाल इंग्लैंड के ही नाम है. उसने 2019 में न्यूजीलैंड को हराकर यह खिताब जीता था. इंग्लैंड टी20 विश्व कप भी जीत चुका है.</p><p class="pageContent">इंग्लैंड ने मार्च 1877 में मेलबर्न में टेस्ट इतिहास का पहला मुकाबला ऑस्ट्रेलिया से खेला था. इस मैच में टीम को हार मिली थी. इंग्लैंड के पहले कप्तान जेम्स लिलीव्हाइट जूनियर थे. हालांकि इंग्लैंड को पहली टेस्ट जीत,  दूसरे ही मुकाबले में मिल गई थी. इंग्लैंड ने 31 मार्च 1877 को मेलबर्न में ही ऑस्ट्रेलिया को 4 विकेट से हराया. इंग्लैंड को घर में पहली टेस्ट जीत 1880 में मिली. टीम ने ओवल में खेले गए मैच में ऑस्ट्रेलिया को 5 विकेट से हराया था. इंग्लैंड की ओर से टेस्ट में रिकॉर्ड 81 खिलाड़ी कप्तानी कर चुके हैं. 16 खिलाड़ी बतौर कप्तान एक भी टेस्ट नहीं जीत सके हैं. जो रूट ने बतौर कप्तान सबसे अधिक 27 टेस्ट जीते हैं.</p><p class="pageContent">टेस्ट में एक पारी में 900 रन बनाने वाली इंग्लैंड दुनिया की पहली टीम थी. अब तक सिर्फ 2 ही टीमें यह कारनामा कर सकी हैं. एक पारी में सबसे अधिक रन बनाने के टॉप-3 स्कोर में इंग्लैंड की टीम 2 में शामिल है. टीम ने 1930 में वेस्टइंडीज के खिलाफ 849 रन बनाए थे.</p>',
  "INDIA": '<p class="pageContent">क्रिकेट भारत का सबसे लोकप्रिय खेल है. भारत (India) में क्रिकेट खेलने का जिक्र पहली बार 19वीं शताब्दी में मिलता है. इंटरनेशनल मैचों की बात करें तो भारत (Indian Cricket Team) ने पहला टेस्ट 25 जून 1932 को इंग्लैंड के खिलाफ लॉर्ड्स में खेला. तब टीम इंडिया (Team India) को इस मैच में 158 रन से हार मिली. भारत के पहले टेस्ट कप्तान सीके नायडू थे.</p><p class="pageContent">भारतीय टीम इस समय विश्व क्रिकेट की बड़ी ताकत है. भारत वनडे फॉर्मेट में दो बार विश्व कप जीत चुका है. पहला टी20 वर्ल्ड कप भी भारत के ही नाम है. दिलचस्प बात यह है कि भारत एकमात्र टीम है, जिसने 60 ओवर, 50 ओवर और 20 ओवर के विश्व कप जीते हैं.</p><p class="pageContent">भारत को टेस्ट क्रिकेट में पहली जीत के लिए 20 साल तक इंतजार करना पड़ा. भारत ने 6 फरवरी 1952 को चेन्नई में खेले गए टेस्ट में इंग्लैंड को पारी और 8 रन से हराकर टेस्ट की पहली जीत हासिल की. टीम के कप्तान विजय हजारे थे. टीम इंडिया को विदेश में पहली टेस्ट जीत 1968 में मिली थी. भारत ने डुनेडिन में खेले गए मैच में न्यूजीलैंड को 5 विकेट से हराया था. मंसूर अली खान पटौदी के नेतृत्व में टीम ने सीरीज पर भी 3-1 से कब्जा किया था. यह विदेश में टीम की पहली टेस्ट सीरीज जीत थी.</p><p class="pageContent">भारत को पाकिस्तान के खिलाफ पहली जीत मोहिंदर अमरनाथ की कप्तानी में मिली थी. 16 अक्टूबर 1952 को दिल्ली में खेले गए मैच में टीम ने पाकिस्तान को पारी और 70 रन से करारी शिकस्त दी थी. बाएं हाथ के स्पिन गेंदबाज वीनू मांकड़ ने मैच में 13 विकेट लिए थे. टीम इंडिया की ओर से टेस्ट में अब तक 33 कप्तान उतर चुके हैं.</p>',
  "NEW ZEALAND": '<p class="pageContent">क्रिकेट अगर जेंटलमेन गेम है तो न्यूजीलैंड (New Zealand) इसका ब्रॉन्ड एंबेसडर. टेस्ट फॉर्मेट की पहली विश्व चैंपियनशिप जीतने वाली न्यूजीलैंड की टीम का क्रिकेट जगत में बेहतरीन रिकॉर्ड है. न्यूजीलैंड ने पहला इंटरनेशनल मैच 1930 में खेला था. उसने पहला टेस्ट मैच क्राइस्टचर्च में इंग्लैंड के खिलाफ खेला था. न्यूजीलैंड को इस मुकाबले में 8 विकेट से हार मिली थी.</p><p class="pageContent">न्यूजीलैंड को पहली टेस्ट जीत के लिए 26 साल तक इंतजार करना पड़ा. 9 मार्च 1956 को आकलैंड में खेले गए मैच में न्यूजीलैंड ने वेस्टइंडीज को 190 रन से हराया था. यह टीम की पहली टेस्ट जीत थी. टीम के कप्तान जॉन रीड थे. टीम को विदेश में पहली जीत 1 जनवरी 1962 को मिली. टीम ने केपटाउन में खेले गए टेस्ट में साउथ अफ्रीका को 72 रन से मात दी थी. तब भी टीम के कप्तान जॉन रीड ही थे. टीम टेस्ट क्रिकेट की एक पारी में 700 रन बनाने का कारनामा कर चुकी है. टीम की ओर से टेस्ट में अब तक 30 खिलाड़ी कप्तानी कर चुके हैं. 13 कप्तान एक भी टेस्ट नहीं जीत सके हैं. स्टीफन फ्लेमिंग की कप्तानी में टीम ने सबसे अधिक 28 टेस्ट जीते हैं. सिर्फ 2 ही कप्तान 20 से अधिक टेस्ट जीत सके हैं.</p>',
  "PAKISTAN": '<p class="pageContent">पाकिस्तान की टीम एशिया की मजबूत टीमों में से एक है. पाकिस्तान (Pakistan) ने पहला टेस्ट भारत के खिलाफ दिल्ली में 16 अक्टूबर 1952 को खेला था. हालांकि मैच में टीम को पारी से हार मिली. उसने अगले मैच में ही भारत को पारी से हराकर हिसाब बराबर कर लिया था. पाकिस्तान को पहली जीत अब्दुल कारदर की कप्तानी में मिली थी. अब्दुल कारदर भारतीय टीम की ओर से भी टेस्ट खेल चुके थे. आजादी के बाद वे पाकिस्तान चले गए थे.</p><p class="pageContent">पाकिस्तान को घर में पहली जीत अक्टूबर 1955 में मिली थी. टीम ने कराची में खेले गए मुकाबले में न्यूजीलैंड को पारी से हराया था. पाकिस्तान की ओर से अब तक टेस्ट में 34 खिलाड़ी कप्तानी कर चुके हैं. 10 कप्तान एक भी टेस्ट नहीं जीत सके हैं. मिस्बाह उल हक ने बतौर कप्तान सबसे अधिक 26 टेस्ट जीते हैं. अन्य कोई कप्तान 20 टेस्ट नहीं जीत सका है. टीम सबसे अधिक टेस्ट खेलने वाले देशों की लिस्ट में भी शामिल नहीं है.</p><p class="pageContent">पाकिस्तान ने टेस्ट मैचों के साथ-साथ वनडे और टी20 फॉर्मेट में भी बेहतरीन प्रदर्शन किया है. पाकिस्तान ने 1992 में इमरान खान की कप्तानी में वनडे फॉर्मेट का विश्व कप जीता था. तब उसने फाइनल में इंग्लैंड को हराया था. पाकिस्तान की टीम एक बार टी20 विश्व कप भी जीत चुकी है.</p>',
  "SOUTH AFRICA": '<p class="pageContent">दक्षिण अफ्रीका ने टेस्ट क्रिकेट की शुरुआत 1900 से पहले कर दी थी. उसने पहला मुकाबला 12 मार्च 1889 को इंग्लैंड के खिलाफ घर में खेला था. इस मुकाबले में टीम को हार मिली थी. टीम को पहली जीत जनवरी 1906 में मिली थी. दक्षिण अफ्रीका ने जोहानिसबर्ग में खेले गए इस मैच में इंग्लैंड को एक विकेट से हराया था. विजेता टीम के कप्तान पर्सी शेरवेल थे.</p><p class="pageContent">दक्षिण अफ्रीका को विदेश में पहली जीत 1911 में मिली. उसने एडिलेड में खेले गए टेस्ट में ऑस्ट्रेलिया को 38 रन से हराया था. टीम के कप्तान पर्सी शेरवेल ही थे. दक्षिण अफ्रीकी टीम टेस्ट की एक पारी में अब तक 700 रन का आंकड़ा नहीं छू सकी है.</p><p class="pageContent">नस्लभेदी नियम के चलते आईसीसी ने सालों तक दक्षिण अफ्रीका के खेलने पर बैन लगा दिया था. इस कारण टीम इंटरनेशनल क्रिकेट में पिछड़ गई. टीम की ओर से अब तक 37 खिलाड़ी टेस्ट में कप्तानी कर चुके हैं. 12 कप्तान एक भी मैच नहीं जीत सके. ग्रीम स्मिथ ने सबसे अधिक 53 टेस्ट जीते हैं. वे बतौर कप्तान दुनिया में सबसे अधिक टेस्ट जीतने वाले खिलाड़ी हैं. अन्य कोई खिलाड़ी बतौर कप्तान 50 टेस्ट नहीं जीत सका है.</p>',
  "SRI LANKA": '<p class="pageContent">टेस्ट क्रिकेट की शुरुआत 1877 में हुई. लेकिन श्रीलंका (Sri Lanka) ने पहला टेस्ट 1982 में खेला. यानी इस देश में क्रिकेट तकरीबन 100 साल पीछे चल रहा था. इसके बावजूद विश्व क्रिकेट में श्रीलंका की कामयाबी काबिलेतारीफ है. श्रीलंका की टीम वनडे और टी20 विश्व कप एक-एक बार जीत चुकी है. इस देश ने मुथैया मुरलीधरन, सनथ जयसूर्या, महेला जयवर्धने, कुमार संगकारा, अर्जुन रणतुंगा, अरविंद डिसिल्वा जैसे विश्व स्तरीय क्रिकेटर दिए हैं. मुरलीधरन के नाम टेस्ट क्रिकेट में सबसे अधिक 800 विकेट लेने का विश्व रिकॉर्ड है.</p><p class="pageContent">श्रीलंका को 17 फरवरी 1982 को कोलंबो में इंग्लैंड से खेले गए पहले टेस्ट में हार मिली थी. उसे पहली जीत 6 सितंबर 1985 को भारत के खिलाफ मिली. श्रीलंका ने कोलंबो में खेले गए मैच में 149 रन से जीत दर्ज की थी. श्रीलंका को विदेश में पहली जीत के लिए 13 साल तक इंतजार करना पड़ा था. 11 मार्च 1995 को नेपियर में खेले गए टेस्ट में टीम ने न्यूजीलैंड को 241 रन से मात दी थी. टेस्ट का सबसे बड़ा स्कोर बनाने का वर्ल्ड रिकॉर्ड श्रीलंका के ही नाम है. टीम ने 2 अगस्त 1997 को भारत के खिलाफ कोलंबो में 6 विकेट पर 952 रन का विशाल स्कोर खड़ा किया था. टीम की ओर से अब तक 17 कप्तान टेस्ट में उतर चुके हैं. 2 को एक भी जीत नहीं मिली है. सनथ जयसूर्या और महेला जयवर्धने ने अपनी कप्तानी में सबसे अधिक 18-18 टेस्ट जीते हैं. बड़े खिलाड़ियों के संन्यास लेने के बाद श्रीलंका का प्रदर्शन भी पिछले कुछ समय से इंटरनेशनल लेवल पर खराब रहा है.</p>',
  "WEST INDIES": '<p class="pageContent">वेस्टइंडीज (West Indies) की जब भी बात की जाती है तो सबसे पहले उसके लंबे कद-काठी के तेज गेंदबाज याद आते हैं. वेस्टइंडीज ने पहला टेस्ट 23 जून 1928 को लॉर्ड्स में इंग्लैंड के खिलाफ खेला. तब कैरेबियाई टीम के कप्तान कार्ल नुनेस थे. हालांकि, टीम यह मुकाबला हार गई थी. वेस्टइंडीज को पहली जीत 21 फरवरी 1930 को छठे टेस्ट में मिली थी. जॉर्जटाउन में खेले गए इस मुकाबले में उसने इंग्लैंड को 289 रन से हराया था. कप्तान माउराइस फर्नांडेज थे.</p><p class="pageContent">वेस्टइंडीज ने 1958 में पाकिस्तान के खिलाफ 3 विकेट पर 790 रन बनाकर टेस्ट का अपना सबसे बड़ा स्कोर बनाया. टीम का 1970 के दशक से 1995 तक वर्ल्ड क्रिकेट पर दबदबा रहा. टीम लगातार 29 सीरीज में अपराजेय रही. अन्य कोई टीम 20 अपराजेय सीरीज का आंकड़ा भी अब तक नहीं छू सकी है. वेस्टइंडीज ने 550 से अधिक टेस्ट खेले हैं. टीम की ओर से 37 खिलाड़ी टेस्ट में कप्तानी कर चुके हैं. 12 को एक भी टेस्ट में जीत नहीं मिली है. टीम ने क्वाइव लॉयड की कप्तानी में सबसे अधिक 36 टेस्ट जीते हैं.</p><p class="pageContent">वेस्टइंडीज ने वनडे और टी20 वर्ल्ड कप दो-दो बार जीते हैं. वनडे विश्व कप के पहले दो खिताब कैरीबियाई टीम के ही नाम हैं. बेहतरीन इतिहास के बावजूद वेस्टइंडीज के खिलाड़ी अब टेस्ट की जगह टी20 फॉर्मेट को अधिक तरजीह दे रहे हैं. इस कारण टीम का प्रदर्शन टेस्ट में लगातार गिरा है. 2005 से 2007 के बीच टीम ने लगातार 7 सीरीज गंवाई थी.</p>'
};

const SeriesTabs = {
  NEWS: 'news',
  MATCH_SCHEDULE: 'match-schedule',
  RESULT: 'result',
  PHOTO: 'photos',
  VIDEO: 'videos',
};

const SeriesPages = ['news', 'match-schedule', 'result', 'photos', 'videos'];

const generateSeriesDesktopAds = (pageType) => {
  let adSlotNames = {};
  if (pageType === SeriesTabs.NEWS) {
    adSlotNames = { firstSlotName: "IPLT20", secondSlotName: "IPLT20_IPLT20", thirdSlotName: "IPLT20_NWS" };
  } else if (pageType === SeriesTabs.MATCH_SCHEDULE) {
    adSlotNames = { firstSlotName: "SCHEDULE", secondSlotName: "SCHEDULE", thirdSlotName: "SDLE" };
  } else if (pageType === SeriesTabs.RESULT) {
    adSlotNames = { firstSlotName: "RESULT", secondSlotName: "RESULT", thirdSlotName: "RSLT" };
  } else if (pageType === SeriesTabs.PHOTO) {
    adSlotNames = { firstSlotName: "IPLT20", secondSlotName: "IPLT20_IPLT20", thirdSlotName: "IPLT20_PHT" };
  } else if (pageType === SeriesTabs.VIDEO) {
    adSlotNames = { firstSlotName: "IPLT20", secondSlotName: "IPLT20_IPLT20", thirdSlotName: "IPLT20_VID" };
  }
  return adSlotNames;
};

export {
  MatchScheduleTabs,
  CricketNextImgUrls,
  PlayerProfileTabs,
  PlayerProfileTableHeaders,
  TeamsBioContent,
  SeriesTabs,
  SeriesPages,
  generateSeriesDesktopAds
};
