import React, { useState } from "react";

const StaticContent = () => {
  const [fullHeight, setFullHeight] = useState(false);
  return (
    <>
      <div className={`read_less_containr ${fullHeight ? "read_full_containr" : ""}`}>
        <p className="pageContent">
          News18 हिंदी (News18 हिंदी) के स्पेशल क्रिकेट पेज पर आपका स्वागत है. इस पेज पर क्रिकेट से जुड़े हर वो अपडेट मिलेंगे, जो आप चाहते
          हैं. पल-पल की ताजा खबरें और तस्वीरें, मैचों के लाइव स्कोर (Live Score), फुल स्कोरकार्ड (Full Scorecard), लाइव अपडेट (Live Update),
          हर बॉल की कॉमेंट्री और मैच रिपोर्ट सब कुछ यहां मिलेगा. क्रिकेट इतिहास को समेटे ‘आज का किस्सा (On This Day)’ होगा और ‘नंबर गेम
          (Number Game)’ रिकॉर्डबुक को कहानियों की शक्ल में पेश करेगा. ब्लॉग और पॉडकास्ट के फॉर्मेट में एक्सपर्ट की राय सामने होगी तो किसी
          बड़े इवेंट को हर एंगल से कवर करता एनालिसिस भी होगा. आज की डिजिटल दुनिया में सोशल मीडिया को कैसे इग्नोर करेंगे? इसीलिए फेसबुक,
          ट्विटर और इंस्टाग्राम पर चलने वाली हर वो कहानी, तस्वीरें और वीडियो भी इस वेबसाइट पर मिलेंगे, जो क्रिकेटप्रेमी चाहते हैं. फेसबुक
          लाइव पाठकों को वेबसाइट से सीधे जुड़ने और क्रिकेट पर अपनी राय रखने का मौका देगा.
        </p>
        <p className="pageContent">
          1877 में इंग्लैंड और ऑस्ट्रेलिया के टेस्ट मुकाबले से शुरू हुआ इंटरनेशनल क्रिकेट आज दुनियाभर में पहुंच चुका है. इसका विस्तार सिर्फ
          देश-दुनिया में नहीं हुआ है. इसके स्वरूप में भी बड़ा बदलाव आया है. कभी 5-6 दिन या रिजल्ट आने तक चलने वाला यह खेल अब एक दिवसीय (ODI)
          और तीन घंटे (T20) के फॉर्मेट में भी लोगों के दिलों पर राज कर रहा है. आईपीएल जैसी टी20 लीग तो अब भारत समेत तमाम देशों में खेली जा
          रही हैं. तीन फॉर्मेट और उस पर तमाम टी20 लीग... तकरीबन हर घंटे दुनिया के किसी ना किसी कोने में मैच चल रहे होते हैं. हमारी इस
          वेबसाइट पर इन तमाम मैचों का कार्यक्रम (Schedule) और नतीजे (Results) मिलेंगे.
        </p>
        <p className="pageContent">
          किसी भी खेल में टीमों के बेहतरीन होने का पैमाना वर्ल्ड कप (ICC World Cup) या कॉन्टीनेंटल कप जैसे टूर्नामेंट होते हैं. अब ऐसे
          टूर्नामेंट हर महीने या हर साल तो होने से रहे. इसीलिए टीमों के बेहतरीन होने का पैमाना आईसीसी रैंकिंग (ICC Rankings) हैं. आईसीसी
          (अंरराष्ट्रीय क्रिकेट परिषद) क्रिकेट को चलाने वाली दुनिया की शीर्ष संस्था है. यह ना सिर्फ खेल के नियम तय करती है, बल्कि समय-समय पर
          रैंकिंग भी जारी करती है. इन रैंकिंग को हिंदी में सबसे पहले यह वेबसाइट लेकर आती है.
        </p>
        <p className="pageContent">
          अब थोड़ी बात क्रिकेट की. इसकी शुरुआत इंग्लैंड में करीब 400 साल पहले हुई. भारत में यह खेल पहली बार 19वीं शताब्दी में खेला गया.
          टेस्ट मैच (Test Match) क्रिकेट का सबसे पुराना और उच्चतम फॉर्मेट है. 1877 में पहला टेस्ट खेले जाने के 94 साल बाद इस खेल का दूसरा
          फॉर्मेट सामने आया. 1971 में इंग्लैंड और ऑस्ट्रेलिया के बीच पहला एकदिवसीय मैच (ODI Match) खेला गया. इसके 34 साल बाद क्रिकेट को इसका
          तीसरा फॉर्मेट मिला, जो टी20 मैच (T20I Match) कहलाता है. दुनिया के सिर्फ 12 देशों को टेस्ट क्रिकेट खेलने की पात्रता है. जबकि 120 से
          अधिक देश टी20 मैच खेलते हैं.
        </p>
        <p className="pageContent">
          क्रिकेट का जन्मदाता इंग्लैंड (England) है, लेकिन सबसे ज्यादा उपलब्धियां ऑस्ट्रेलिया (Australia) के नाम है. ऑस्ट्रेलिया के नाम
          क्रिकेट के तीनों फॉर्मेट की पहली जीत है. उसने पहले टेस्ट और पहले वनडे में इंग्लैंड को और पहले टी20 मैच में न्यूजीलैंड (New
          Zealand) को हराया. सबसे अधिक वनडे विश्व कप भी ऑस्ट्रेलिया ने ही जीते हैं. टेस्ट रैंकिंग में सबसे लंबे समय तक नंबर-1 रहने का
          रिकॉर्ड भी कंगारू ब्रिगेड के नाम है. ऑस्ट्रेलिया के ही सर डॉन ब्रैडमैन (Don Bradman) को दुनिया का सर्वश्रेष्ठ बल्लेबाज होने का
          रुतबा हासिल है.
        </p>
        <p className="pageContent">
          इंटरनेशनल क्रिकेट में ऑस्ट्रेलिया और इंग्लैंड के दबदबे को सबसे पहले वेस्टइंडीज और फिर भारत ने चुनौती दी. वेस्टइंडीज (West Indies)
          की टीम 1970-80 के दशक में हर फॉर्मेट में लगभग अजेय रही. उसने इसी दौर में वनडे फॉर्मेट के पहले दो विश्व कप (ICC World Cup) जीते.
          एंडी रॉबर्ट्स, जोएल गार्नर, वेस हॉल, माइकल होल्डिंग, मैल्कम मार्शल, चार्ली ग्रिफिथ, कॉलिन क्राफ्ट जैसे कैरेबियाई गेंदबाज 70-80 के
          दशक में दुनियाभर के बल्लेबाजों के लिए खौफ जैसे थे.
        </p>
        <p className="pageContent">
          भारत (India) में क्रिकेट 20वीं सदी की शुरुआत से ही लोकप्रिय है. साल 1983 भारत में क्रिकेट के लिए टर्निंग पॉइंट रहा. भारत ने इस साल
          कपिल देव (Kapil Dev) की कप्तानी में वेस्टइंडीज को हराकर विश्व कप जीता. इसके बाद तो क्रिकेट गांव-गांव में लोक्रपिय हो गया. 1987 में
          भारत ने पहली बार विश्व कप की मेजबानी की. यह पहला मौका था जब इंग्लैंड से बाहर विश्व कप का आयोजन हुआ. इसके बाद भारत ने महेंद्र सिंह
          धोनी (Mahendra Singh Dhoni) की कप्तानी में 2007 में पहली टी20 वर्ल्ड चैंपियनशिप (T20 World Championship) और 2011 में वनडे का विश्व
          कप भी जीता. कपिल देव, सुनील गावस्कर, सचिन तेंदुलकर, अनिल कुंबले, महेंद्र सिंह धोनी, विराट कोहली भारत के महान क्रिकेटरों में शामिल
          हैं.{" "}
        </p>
        <p className="pageContent">
          इंग्लैंड, ऑस्ट्रेलिया, भारत, वेस्टइंडीज के अलावा पाकिस्तान, न्यूजीलैंड, दक्षिण अफ्रीका, श्रीलंका विश्व की प्रमुख क्रिकेट टीमें
          हैं. पाकिस्तान और श्रीलंका वनडे और टी20 विश्व चैंपियन रह चुके हैं. न्यूजीलैंड के नाम पहली वर्ल्ड टेस्ट चैंपियनशिप (ICC World Test
          Championship) है. दक्षिण अफ्रीका बेहद मजबूत टीम होने के बावजूद कभी भी विश्व कप नहीं जीत सका है. इसीलिए इस टीम को चोकर भी कहा जाता
          है. जिम्बाब्वे, बांग्लादेश, आयरलैंड और अफगानिस्तान क्रिकेट की अपेक्षाकृत नई टीमें हैं, जिन्हें टेस्ट मैच खेलने की मान्यता दी गई
          है.
        </p>
      </div>
      {!fullHeight && (
        <div className="buttonGrp rd_full" onClick={setFullHeight}>
          <button type="button">और पढ़ें</button>
          <div className="arrows"></div>
        </div>
      )}
      <style jsx global>{`
        .read_less_containr {
          display: block;
          overflow: hidden;
          position: relative;
          height: 144px;
          margin-top: 20px;
        }
        .read_full_containr {
          height: auto !important;
        }
        .pageContent {
          font-size: 16px;
          line-height: 1.5;
          margin-top: 10px;
          font-weight: 300;
          margin-bottom: 15px;
        }
        .buttonGrp {
          position: relative;
          width: 136px;
          margin: 10px auto 10px;
        }
        .buttonGrp button {
          background-color: #eb3d3c;
          border: none;
          width: 100%;
          padding: 10px 15px 10px 0px;
          box-sizing: border-box;
          border-radius: 20px;
          cursor: pointer;
          color: #fff;
          font-size: 14px;
          line-height: 19px;
          font-weight: 400;
          outline: none;
          font-family: 'Mukta',sans-serif;
        }
        .buttonGrp .arrows {
          position: absolute;
          top: 20px;
          right: 12px;
          width: 13px;
          height: 1px;
          background-color: #fff;
          transform: rotate(89deg);
        }

        .buttonGrp .arrows:before,
        .buttonGrp .arrows:after {
          content: "";
          position: absolute;
          width: 7px;
          height: 1px;
          top: -2px;
          right: -1px;
          background-color: #fff;
          transform: rotate(45deg);
        }
        .buttonGrp .arrows:after {
          top: 2px;
          transform: rotate(-45deg);
        }
        .CN-Mobile-HomeOuter .read_less_containr{
          margin-top:0;
        }
        .CN-Mobile-HomeOuter .pageContent {
          padding: 10px;
          margin:0;
        }
      `}</style>
    </>
  );
};
export default StaticContent;
