const teamTranslationArr = {
    "dabang-delhi-kc": "दबंग दिल्ली केसी",
    "bengal-warriors": "बंगाल वारियर्स",
    "up-yoddha": "यूपी योद्धा",
    "u-mumba": "यू मुंबा",
    "haryana-steelers": "हरियाणा स्टीलर्स",
    "bengaluru-bulls": "बेंगलुरू बुल्स",
    "jaipur-pink-panthers": "जयपुर पिंक पैंथर्स",
    "patna-pirates": "पटना पायरेट्स",
    "gujarat-giants": "गुजरात जायंट्स",
    "puneri-paltan": "पुणेरी पलटन",
    "telugu-titans": "तेलुगू टाइटंस",
    "tamil-thalaivas": "तमिल थलाइवाज"
};

const proKabaddiTeams = {};

let proTeamArr = {
    name: 'Gujarat Giants',
    slug: 'gujarat-giants',
    id: 31,
    desc: 'प्रो कबड्डी लीग (Pro Kabaddi league) में गुजरात फॉर्च्यून जायंट्स (Gujarat Fortune Giants) की एंट्री सीजन 5 में हुई. यह टीम शहर आधारित लीग में अहमदाबाद (गुजरात) का प्रतिनिधित्व करती है. गुजरात फॉर्च्यून जायंट्स अपने स्थानीय मुकाबले ट्रांसस्टैडिया के एरीना में खेलती है. पीकेएल (PKL) की इस टीम के मौजूदा कप्तान सुनील कुमार (Sunil Kumar Malik) और मनप्रीत सिंह (Manpreet Singh) कोच हैं. टीम का मालिकाना हक अदानी विल्मर लिमिटेड (Adani Wilmar Ltd) के पास है. <br/> गुजरात फॉर्च्यून जायंट्स (Gujarat Fortune Giants) की टीम लीग के 2017 और 2018 सीजन के फाइनल में पहुंची. लेकिन दोनों ही बार उसे हार का सामना करना पड़ा. गुजरात फॉर्च्यून जायंट्स को 2017 के फाइनल में पटना पाइरेट्स (Patna Pirates) और 2018 में बेंगलुरू बुल्स (Bengaluru Bulls) ने हराया.'
}
proKabaddiTeams[proTeamArr.slug] = proTeamArr;

proTeamArr = {
    name: 'U Mumba',
    slug: 'u-mumba',
    id: 5,
    desc: 'यू मुंबा प्रो कबड्डी लीग (Pro Kabaddi league) की शुरुआती टीमों में से एक है. यू मुंबा (U Mumba) की टीम शहर आधारित लीग में मुंबई (महाराष्ट्र) का प्रतिनिधित्व करती है. पीकेएल (PKL) की इस टीम का नेतृत्व वर्तमान में फ़ज़ल अतरचली (Fazel Atrachali) कर रहे हैं. संजीव कुमार बालियान (Sanjeev Kumar Baliyan) इसके कोच हैं. यू मुंबा (U Mumba), सरदार वल्लभभाई पटेल इंडोर स्टेडियम में अपने घरेलू मैच खेलती है. यूनिलेज़र वेंचर्स प्राइवेट के पास टीम का मालिकाना हक है. यूनिलेज़र वेंचर्स प्राइवेट का स्वामित्व रोनी स्क्रूवाला के पास है.<br/>यू मुंबा की टीम प्रो कबड्डी लीग (Pro Kabaddi league) के उद्घाटन सत्र में उपविजेता रही थी. उसे फाइनल में जयपुर पिंक पैंथर्स (Jaipur Pink Panthers) ने हराया था. इसके बाद उसने 2015 (सीजन 2) में प्रो कबड्डी लीग के फाइनल में बेंगलुरु बुल्स को हराकर का अपना पहला खिताब जीता. यू मुंबा की टीम 2016 (सीजन 3) में भी फाइनल में पहुंची. लेकिन इस बार वह पटना पाइरेट्स के सामने नहीं टिक सकी. पटना पायरेट्स (Patna Pirates) ने 2016 का खिताब अपने नाम किया',
}
proKabaddiTeams[proTeamArr.slug] = proTeamArr;

proTeamArr = {};
proTeamArr.name = 'Dabang Delhi K.C.';
proTeamArr.slug = 'dabang-delhi-kc';
proTeamArr.id = 2;
proTeamArr.img = '';
proTeamArr.desc = 'दबंग दिल्ली प्रो कबड्डी लीग (Pro Kabaddi league) की शुरुआती टीमों में से एक है. यह टीम 2014 से ही इस लीग में हिस्सा ले रही है. दबंग दिल्ली (Dabang Delhi) की टीम शहर आधारित लीग में दिल्ली का प्रतिनिधित्व करती है. यह टीम अपने घरेलू मैच दिल्ली के त्यागराज स्पोर्ट्स कॉम्प्लेक्स में मैच खेलती है. पीकेएल (PKL) की इस टीम का नेतृत्व वर्तमान में जोगिंदर सिंह नरवाल (Joginder Singh Narwal) कर रहे हैं. कृष्ण कुमार हुड्डा (Krishan Kumar Hooda) टीम के कोच हैं. <br/>दबंग दिल्ली का मालिकाना हक राधा कपूर (Radha Kapoor) के पास है. दबंग दिल्ली की टीम पीकेएल के 2019 के सीजन में उपविजेता रही थी. यह एकमात्र मौका था, जब यह टीम लीग के फाइनल में पहुंची.'; proKabaddiTeams[proTeamArr.slug] = proTeamArr;

proTeamArr = {
    name: 'Puneri Paltan',
    slug: 'puneri-paltan',
    id: 7,
    desc: 'पुणेरी पलटन प्रो कबड्डी लीग (Pro Kabaddi league) की शुरुआती टीमों में से एक है. पुणेरी पलटन (Puneri Paltan) की टीम शहर आधारित लीग में पुणे (महाराष्ट्र) का प्रतिनिधित्व करती है. यह टीम अपने घरेलू मैच पुणे के श्री शिव छत्रपति स्पोर्ट्स कॉम्प्लेक्स में मैच खेलती है. पीकेएल (PKL) की इस टीम के मौजूदा कोच अनूप कुमार (Anup Kumar) हैं. दीपक हुड्डा (Deepak Hooda) टीम के मौजूदा कप्तान हैं. पुणेरी पलटन का मालिकाना हक राजेश हरकिशनदास जोशी, सुमनलाल बाबूलाल शाह, एन. रामास्वामी सुब्रमणियन के पास है. <br/> पुणेरी पलटन की टीम की प्रो कबड्डी लीग में शुरुआत अच्छी नहीं रही थी. यह टीम लीग के शुरुआती दो सीजन में आखिरी स्थान पर रही. इसके बाद टीम ने अपनी गलतियां पहचान कर उन्हें सुधारा. पुणेरी पलटन तीसरे सीजन में प्लेऑफ में जगह बनाई और तीसरे स्थान पर रही. साल 2017 में भी टीम प्लेऑफ में जगह बनाने में कामयाब रही'
};

proKabaddiTeams[proTeamArr.slug] = proTeamArr;

proTeamArr = {
    name: 'Jaipur Pink Panthers',
    slug: 'jaipur-pink-panthers',
    id: 3,
    desc: 'जयपुर पिंक पैंथर्स प्रोफेशनल कबड्डी टीम है. यह प्रो कबड्डी लीग (Pro Kabaddi league) के पहले सीजन से ही इसका हिस्सा है. जयपुर पिंक पैंथर्स (Jaipur Pink Panthers) की टीम शहर आधारित लीग में पिंक सिटी जयपुर (राजस्थान) का प्रतिनिधित्व करती है. यह टीम अपने घरेलू मैच जयपुर के सवाई मानसिंह इंडोर स्टेडियम में मैच खेलती है. <br/> जयपुर पिंक पैंथर्स के मौजूदा कोच श्रीनिवास रेड्डी (Srinivas Reddy) हैं. दीपक निवास हुड्डा (Deepak Hooda) टीम के मौजूदा कप्तान हैं. पीकेएल (PKL) की इस टीम का मालिकाना हक बॉलीवुड एक्टर अभिषेक बच्चन (Abhishek Bachchan) के पास है. जयपुर पिंक पैंथर्स प्रो कबड्डी लीग की पहली चैंपियन टीम है. उसने 2014 में पहले सीजन में ही खिताब अपने नाम किया था. हालांकि, अगले दो सीजन टीम का प्रदर्शन अच्छा नहीं रहा. साल 2014 में एक बार फिर यह टीम प्लेऑफ में जगह बनाने में कामयाब रही.',
};

proKabaddiTeams[proTeamArr.slug] = proTeamArr;

proTeamArr = {
    name: 'Haryana Steelers',
    slug: 'haryana-steelers',
    id: 28,
    desc: 'हरियाणा स्टीलर्स (Haryana Steelers) प्रोफेशनल कबड्डी टीम है. यह टीम प्रो कबड्डी लीग (Pro Kabaddi league) के पांचवें सीजन (2017) में इसका हिस्सा बनी. हरियाणा स्टीलर्स की टीम शहर आधारित लीग में पंचकूला (हरियाणा) का प्रतिनिधित्व करती है. यह टीम अपने घरेलू मैच ताऊ देवी लाल क्रिकेट स्टेडियम में मैच खेलती है. हरियाणा स्टीलर्स के मौजूदा कोच राकेश कुमार (Rakesh Kumar) हैं. टीम के मौजूदा कप्तान धर्मराज चेरालथन (Dharmaraj Cheralathan) हैं. पीकेएल (PKL) की इस टीम का स्वामित्व जेएसडब्ल्यू स्पोर्ट्स (JSW Sports) के पास है. <br/> हरियाणा स्टीलर्स को स्टीलर्स के नाम से भी जाना जाता है. स्टीलर्स की प्रो कबड्डी लीग में शानदार शुरुआत हुई और यह अपने पहले ही सीजन में प्लेऑफ में जगह बनाने में कामयाब रही. हरियाणा स्टीलर्स अगले सीजन में अपना प्रदर्शन नहीं दोहरा सकी और ग्रुप में आखिरी स्थान पर खिसक गई. सातवें सीजन में टीम ने प्रदर्शन सुधारा लेकिन प्लेऑफ में जगह नहीं बना सकी. इस बार टीम पांचवें नंबर पर रही.',
};

proKabaddiTeams[proTeamArr.slug] = proTeamArr;

proTeamArr = {
    name: 'Bengaluru Bulls',
    slug: 'bengaluru-bulls',
    id: 1,
    desc: 'बेंगलुरू बुल्स (Bengaluru Bulls) एक प्रोफेशनल कबड्डी टीम है. यह टीम प्रो कबड्डी लीग (Pro Kabaddi league) की शुरुआत से ही इसका हिस्सा है. यह टीम शहर आधारित लीग में बेंगलुरू (कर्नाटक) का प्रतिनिधित्व करती है. बेंगलुरू बुल्स अपने घरेलू मैच कांतीरवा इंडोर स्टेडियम में मैच खेलती है. टीम का स्वामित्व कौस्मिक ग्लाबल मीडिया (Kosmik Global Media) के पास है. टीम के मौजूदा कोच रणधीर सिंह (Randhir Singh) हैं. टीम के मौजूदा कप्तान पवन कुमार सहरावत (Pawan Kumar Sherawat) हैं. <br/> बेंगलुरू बुल्स (Bengaluru Bulls) पीकेएल की उन चुनिंदा टीमों में से एक है, जो खिताब जीत चुकी हैं. बुल्स ने यह खिताब 2018 में गुजरात फॉर्च्यून जायंट्स (Gujarat Fortune Giants) को हराकर जीता था. इससे पहले टीम का सबसे अच्छा प्रदर्शन 2015 में था, जब टीम उपविजेता रही थी. बेंगलुरू बुल्स की टीम 2014 में भी सेमीफाइनल में पहुंची थी.',
};

proKabaddiTeams[proTeamArr.slug] = proTeamArr;


proTeamArr = {
    name: 'Bengal Warriors',
    slug: 'bengal-warriors',
    id: 4,
    desc: 'बंगाल वारियर्स (Bengal Warriors) की टीम प्रो कबड्डी लीग (Pro Kabaddi league) के पहले सीजन से खेल रही है. कोलकाता (पश्चिम बंगाल) शहर की टीम अपने घरेलू मुकाबले नेताजी इंडोर स्टेडियम में खेलती है. टीम की कप्तानी मनिंदर सिंह (Maninder Singh) कर रहे हैं. वहीं कोचिंग की जिम्मेदारी बीसी रमेश (BC Ramesh) के पास है. टीम का मालिकाना हक फ्यूचर ग्रुप के पास है. किशोर बियानी (Kishore Biyani) ग्रुप के मालिक हैं. ली जेंग-कुन (Lee Jang-kun) टीम में शामिल एकमात्र खिलाड़ी हैं, टीम की ओर से सभी सीजन में उतरे हैं. <br/> बंगाल वारियर्स की टीम हालांकि लीग (Pro Kabaddi league) में अच्छी शुरुआत नहीं कर सकी थी. पहले सीजन में टीम 7वें स्थान पर रही. 2016 में टीम का प्रदर्शन सुधरा और टीम चौथे नंबर पर रही. 2017 में टीम क्वालिफायर-2 में पटना पायरेट्स (Patna Pirates) से हार गई थी. लेकिन 2019 में टीम ने शानदार प्रदर्शन करते हुए खिताब जीता. टीम ने फाइनल में दबंग दिल्ली (Dabang Delhi) को हराया. इस बार टीम डिफेंडिंग चैंपियन के तौर पर उतर रही है.'
};
proKabaddiTeams[proTeamArr.slug] = proTeamArr;

proTeamArr = {
    name: 'U.P. Yoddha',
    slug: 'up-yoddha',
    id: 30,
    desc: 'यूपी योद्धा (Up Yoddha) की टीम प्रो कबड्डी लीग (Pro Kabaddi league) के शुरुआती सीजन से नहीं खेल रही है. टीम 5वें सीजन से जुड़ी. टीम तब से तीनों सीजन के प्लेऑफ में पहुंची है. ग्रेटर नोएडा (उप्र) की टीम अपने घरेलू मुकाबले शहीद विजय सिंह पथिक स्पोर्ट्स कॉम्प्लेक्स में खेलती है. यूपी के कप्तान नीतेश कुमार (Nitesh Kumar) और कोच जशवीर सिंह (Jasveer Singh) हैं. जीएमआर (GMR) ग्रुप के पास टीम का मालिकाना हक है. ग्रुप के मालिक ग्रुप के मालिक किरन कुमार ग्रांधी (Kiran Kumar Grandhi ) हैं. <br/> यूपी योद्धा की टीम ने लीग के अपने पहले सीजन 2017 में अच्छा प्रदर्शन किया और लीग (Pro Kabaddi league) के एलिमिनेटर में जगह बनाई. 2018 में टीम क्वालिफायर-2 में गुजरात (Gujarat Fortune Giants) से हार गई. 2019 में टीम एक बार फिर प्लेऑफ में पहुंची और ओवरऑल तीसरे नंबर पर रही. टीम को अभी भी पहले खिताब का इंतजार है.'
};
proKabaddiTeams[proTeamArr.slug] = proTeamArr;

proTeamArr = {
    name: 'Patna Pirates',
    slug: 'patna-pirates',
    id: 6,
    desc: 'पटना पायरेट्स (Patna Pirates) की टीम लीग के पहले सीजन से जुड़ी है और लीग के (Pro Kabaddi league) इतिहास की सबसे सफल टीम है. टीम सबसे अधिक तीन बार लीग का टाइटल जीत चुकी है. पटना (बिहार) की टीम अपने घरेलू मुकाबले पाटलिपुत्र कॉम्प्लेक्स में खेलती है. टीम की कमान प्रदीप नरवाल (Pardeep Narwal) के पास है. टीम के कोच राम मेहर सिंह (Ram Mehar Singh ) हैं. राजेश वी शाह (Rajesh V. Shah) के पास टीम का मालिकाना हक है. <br /> टीम पहले सीजन में तीसरे और दूसरे सीजन में चौथे स्थान पर रही. 2016 (Pro Kabaddi league) में टीम पहली बार चैंपियन बनीं. फाइनल में टीम ने यू मुंबा (U Mumba) को हराया था. फिर टीम ने जयपुर पिंक पैंथर्स (Jaipur Pink Panthers) को हराकर टाइटल डिफेंड किया. टीम ने 2017 में गुजरात (Gujarat Fortune Giants) को हराकर खिताब हैट्रिक पूरी की. हालांकि पिछले सीजन में टीम अच्छा प्रदर्शन नहीं कर सकी और टीम 8वें नंबर पर रही.'
};
proKabaddiTeams[proTeamArr.slug] = proTeamArr;

proTeamArr = {
    name: 'Telugu Titans',
    slug: 'telugu-titans',
    id: 8,
    desc: 'तेलुगू टाइटंस (Telugu Titans) की टीम भी लीग के (Pro Kabaddi league) पहले सीजन से उतर रही है. हालांकि टीम अब तक खिताब नहीं जीत सकी है. टीम अपने घरेलू मुकाबले राजीव गांधी इंडोर स्टेडियम विशाखापट्टनम (Andhra Pradesh) और हैदराबाद के जीएमसी बालयोगी इंडोर स्टेडियम में खेलती है. टीम की कमान सिद्धार्थ देसाई (Siddharth Desai) के पास है. कोच गोलमरेजा माजन्दरानी (Gholamreza Mazandarani) हैं. टीम का मालिकाना हक वीरा स्पोर्ट्स के पास है. वीरा स्पोर्ट्स के साथ वाया ग्रुप के श्रीनिवास श्रीरामानेनी, एनईडी ग्रुप के गौतम रेड्डी और ग्रीनको ग्रुप के महेश कोली जुड़े हैं. <br /> तेलुगू टाइटंस (Telugu Titans) की टीम पहले सीजन में (Pro Kabaddi league) 5वें स्थान पर रही थी. दूसरे सीजन में तीसरे स्थान पर रही. टीम कभी भी खिताब नहीं जीत सकी है. अंतिम सीजन में टीम का प्रदर्शन सबसे खराब रहा था और टीम 11वें नंबर पर रही थी. ऐसे में इस बार टीम प्रदर्शन को सुधारना चाहेगी.'
};
proKabaddiTeams[proTeamArr.slug] = proTeamArr;

proTeamArr = {
    name: 'Tamil Thalaivas',
    slug: 'tamil-thalaivas',
    id: 29,
    desc: "तमिल थलाइवाज (Tamil Thalaivas) की टीम लीग की बाद में जुड़ी टीमों में से एक है. टीम पहली बार 2017 में उतरी थी. हालांकि टीम का प्रदर्शन अब तक बेहद खराब रहा है. टीम अपने घरेलू मुकाबले चेन्नई (तमिलनाडु) के जवाहर लाल नेहरू स्टेडियम में खेलती है. सुरजीत सिंह नरवाल (Surjeet Singh Narwal) के पास टीम की कमान है जबकि जे उदयकुमार (J Udayakumar) टीम के कोच हैं. टीम का मालिकाना हक मैगनम स्पोर्ट्स प्राइवेट लिमिटेड के पास है. टीम का प्रदर्शन अब तक हर सीजन में खराब ही रहा है. 2017 में टीम जोन-बी में 6 टीमों में सबसे निचले स्थान पर रही. 2018 में टीम का प्रदर्शन ऐसा ही रहा. 2019 में टीम सीजन की सबसे खराब टीम साबित हुई और सबसे निचले 12वें पर रही थी. टीम 22 में से सिर्फ 4 मुकाबले जीत सकी थी. ऐसे में इस बार उस पर अच्छे प्रदर्शन का दबाव होगा."
};
proKabaddiTeams[proTeamArr.slug] = proTeamArr;

export {
    teamTranslationArr,
    proKabaddiTeams
}